In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\apoliset\appdata\local\programs\python\python311\lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\apoliset\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\apoliset\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\apoliset\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\apoliset\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
data = [
    {
        "emp_id": 101,
        "emp_name": "Akshay",
        "salary": 120000,
        "department": "GenAI",
        "skills_set": ["Python", "LLMs", "LangChain"],
        "assignedornot": True,
        "client_name": "Nokia"
    },
    {
        "emp_id": 102,
        "emp_name": "Ravi",
        "salary": 90000,
        "department": "Backend",
        "skills_set": ["Java", "Spring", "SQL"],
        "assignedornot": False,
        "client_name": None
    },
    {
        "emp_id": 103,
        "emp_name": "Sita",
        "salary": 150000,
        "department": "GenAI",
        "skills_set": ["Python", "RAG", "VectorDB"],
        "assignedornot": True,
        "client_name": "Google"
    },
    {
        "emp_id": 104,
        "emp_name": "John",
        "salary": 110000,
        "department": "Frontend",
        "skills_set": ["React", "JavaScript"],
        "assignedornot": True,
        "client_name": "Nokia"
    },
    {
        "emp_id": 105,
        "emp_name": "Meena",
        "salary": 95000,
        "department": "GenAI",
        "skills_set": ["Python", "Prompt Engineering"],
        "assignedornot": False,
        "client_name": None
    }
]

df = pd.DataFrame(data)
df

,emp_id,emp_name,salary,department,skills_set,assignedornot,client_name
0,101,Akshay,120000,GenAI,"[Python, LLMs, LangChain]",True,Nokia
1,102,Ravi,90000,Backend,"[Java, Spring, SQL]",False,NaN
2,103,Sita,150000,GenAI,"[Python, RAG, VectorDB]",True,Google
3,104,John,110000,Frontend,"[React, JavaScript]",True,Nokia
4,105,Meena,95000,GenAI,"[Python, Prompt Engineering]",False,NaN

In [7]:
#For each department, who has the highest salary
highest_salary_df = df.loc[df.groupby("department")["salary"].idxmax()]
highest_salary_df

,emp_id,emp_name,salary,department,skills_set,assignedornot,client_name
1,102,Ravi,90000,Backend,"[Java, Spring, SQL]",False,NaN
3,104,John,110000,Frontend,"[React, JavaScript]",True,Nokia
2,103,Sita,150000,GenAI,"[Python, RAG, VectorDB]",True,Google

In [8]:
#GenAI employees already assigned to a client
genai_assigned = df[
    (df["department"] == "GenAI") &
    (df["assignedornot"] == True)
]

genai_assigned

,emp_id,emp_name,salary,department,skills_set,assignedornot,client_name
0,101,Akshay,120000,GenAI,"[Python, LLMs, LangChain]",True,Nokia
2,103,Sita,150000,GenAI,"[Python, RAG, VectorDB]",True,Google

In [9]:
#Create a summarized skill set column
df["summarized_skills"] = df["skills_set"].apply(
    lambda skills: ", ".join(skills[:2])
)

df[["emp_name", "summarized_skills"]]

  emp_name           summarized_skills
0   Akshay                Python, LLMs
1     Ravi                Java, Spring
2     Sita                 Python, RAG
3     John           React, JavaScript
4    Meena  Python, Prompt Engineering

In [10]:
#Employees having Python skill and their salaries
python_employees = df[
    df["skills_set"].apply(lambda skills: "Python" in skills)
][["emp_name", "salary"]]

python_employees

  emp_name  salary
0   Akshay  120000
2     Sita  150000
4    Meena   95000

In [11]:
#Total employees count
total_employees = df["emp_id"].count()
total_employees

np.int64(5)

In [12]:
#Count of client-assigned employees
assigned_count = df["assignedornot"].sum()
assigned_count

np.int64(3)

In [13]:
#For each customer, how many employees
client_employee_count = df.groupby("client_name")["emp_id"].count()
client_employee_count

client_name
Google    1
Nokia     2
Name: emp_id, dtype: int64